Tekla Open API Reference for Tekla Structures 2025
ReinforcingBarFilterExpressions.Class Constructor
 Initializes a new instance of the Class class.
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Class()
Public Sub New
See Also
Reference
ReinforcingBarFilterExpressions.Class Class
Tekla.Structures.Filtering.Categories Namespace